/*------------------------------------------
 * 02-1. C 프로그램의 구조와 데이터 출력방법
 ------------------------------------------*/

#include <stdio.h>

int main(void)
{
    // 제어 문자 출력
    printf("Be happy\n");
    printf("1234567890123456789\n");
    printf("My\tfriend\n");  // 탭이동(\t)
    printf("Goot\bd\tchance\n"); // 앞으로 한칸 이동(\b)
    printf("Cow\rW\a\n");  // 맨 앞으로 이동(\r) W 입력(C가 W로 교체됨)후 벨소리(\a)

    // 정수와 실수 출력
    printf("%d\n", 10);
    printf("%lf\n", 3.4);   // 소주점 6자리까지 출력
    printf("%.1f\n", 3.45);  // 소수점 이하 첫째 자리까지 출력(둘째 자리에서 반올림)
    printf("%.10lf\n", 3.4); // 소수점 이하 10자리까지 출력
    printf("%d과 %d의 합은 %d입니다.\n", 10, 20, 10+20);
    printf("%.1lf - %.1lf = %.1lf\n", 3.4, 1.2, 3.4-1.2);

    return 0;
}
